nickfox-taterli/LwIP_STM32F4-Discovery/Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_ll_eth.c
/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx.h"

#include "stm32f4xx_ll_rcc.h"
#include "stm32f4xx_ll_bus.h"
#include "stm32f4xx_ll_system.h"
#include "stm32f4xx_ll_exti.h"
#include "stm32f4xx_ll_cortex.h"
#include "stm32f4xx_ll_utils.h"
#include "stm32f4xx_ll_pwr.h"
#include "stm32f4xx_ll_dma.h"
#include "stm32f4xx_ll_eth.h"
#include "stm32f4xx_ll_gpio.h"

#include "FreeRTOS.h"
#include "task.h"
#include "timers.h"
#include "queue.h"
#include "semphr.h"
#include "event_groups.h"
/** @addtogroup STM32F4xx_LL_Driver
  * @{
  */

/** @defgroup ETH ETH
  * @brief ETH HAL module driver
  * @{
  */
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @defgroup ETH_Private_Constants ETH Private Constants
  * @{
  */
#define ETH_TIMEOUT_SWRESET               500U
#define ETH_TIMEOUT_LINKED_STATE          5000U
#define ETH_TIMEOUT_AUTONEGO_COMPLETED    5000U

SemaphoreHandle_t ETH_TransmitFrame_Semaphore;

/**
  * @}
  */
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @defgroup ETH_Private_Functions ETH Private Functions
  * @{
  */
static void ETH_MACDMAConfig(ETH_HandleTypeDef *heth, uint32_t err);
static void ETH_MACAddressConfig(uint32_t MacAddr, uint8_t *Addr);
static void ETH_MACReceptionEnable(void);
static void ETH_MACReceptionDisable(void);
static void ETH_MACTransmissionEnable(void);
static void ETH_MACTransmissionDisable(void);
static void ETH_DMATransmissionEnable(void);
static void ETH_DMATransmissionDisable(void);
static void ETH_DMAReceptionEnable(void);
static void ETH_DMAReceptionDisable(void);
static void ETH_FlushTransmitFIFO(void);

/**
  * @}
  */
/* Private functions ---------------------------------------------------------*/

/** @defgroup ETH_Exported_Functions ETH Exported Functions
  * @{
  */

/** @defgroup ETH_Exported_Functions_Group1 Initialization and de-initialization functions
  *  @brief   Initialization and Configuration functions
  *
  @verbatim
  ===============================================================================
            ##### Initialization and de-initialization functions #####
  ===============================================================================
  [..]  This section provides functions allowing to:
      (+) Initialize and configure the Ethernet peripheral
      (+) De-initialize the Ethernet peripheral

  @endverbatim
  * @{
  */

/**
  * @brief  Initializes the Ethernet MAC and DMA according to default
  *         parameters.
  * @param  heth pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval HAL status
  */
void LL_ETH_Init(ETH_HandleTypeDef *heth)
{
    uint32_t tmpreg1 = 0U, phyreg = 0U;

    uint32_t err = ETH_SUCCESS;

    /* Allocate lock resource and initialize it */
    //heth->Lock
    /* Init the low level hardware : GPIO, CLOCK, NVIC. */
    LL_ETH_MspInit();

    /* Enable SYSCFG Clock */
    LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SYSCFG);

    /* Select MII or RMII Mode*/
    SYSCFG->PMC &= ~(SYSCFG_PMC_MII_RMII_SEL);
    SYSCFG->PMC |= ETH_MEDIA_INTERFACE_RMII;

    /* Ethernet Software reset */
    /* Set the SWR bit: resets all MAC subsystem internal registers and logic */
    /* After reset all the registers holds their respective reset values */
    ETH->DMABMR |= ETH_DMABMR_SR;


    /* Wait for software reset */
    while ((ETH->DMABMR & ETH_DMABMR_SR) != (uint32_t)RESET)
    {

    }

    /*-------------------------------- MAC Initialization ----------------------*/
    /* Get the ETHERNET MACMIIAR value */
    tmpreg1 = ETH->MACMIIAR;
    /* Clear CSR Clock Range CR[2:0] bits */
    tmpreg1 &= ETH_MACMIIAR_CR_MASK;

    /* CSR Clock Range between 150-183 MHz */
    tmpreg1 |= (uint32_t)ETH_MACMIIAR_CR_Div102;

    /* Write to ETHERNET MAC MIIAR: Configure the ETHERNET CSR Clock Range */
    ETH->MACMIIAR = (uint32_t)tmpreg1;

    /*-------------------- PHY initialization and configuration ----------------*/
    /* Put the PHY in reset mode */
    LL_ETH_WritePHYRegister(heth, PHY_BCR, PHY_RESET);

    /* Delay to assure PHY reset */
    vTaskDelay(PHY_RESET_DELAY);

    /* We wait for linked status */
    do
    {
        LL_ETH_ReadPHYRegister(heth, PHY_BSR, &phyreg);
    }
    while (((phyreg & PHY_LINKED_STATUS) != PHY_LINKED_STATUS));


    /* Enable Auto-Negotiation */
    LL_ETH_WritePHYRegister(heth, PHY_BCR, PHY_AUTONEGOTIATION);

    /* Wait until the auto-negotiation will be completed */
    do
    {
        LL_ETH_ReadPHYRegister(heth, PHY_BSR, &phyreg);

    }
    while (((phyreg & PHY_AUTONEGO_COMPLETE) != PHY_AUTONEGO_COMPLETE));

    /* Read the result of the auto-negotiation */
    LL_ETH_ReadPHYRegister(heth, PHY_SR, &phyreg);

    /* Configure the MAC with the Duplex Mode fixed by the auto-negotiation process */
    if((phyreg & PHY_DUPLEX_STATUS) != (uint32_t)RESET)
    {
        /* Set Ethernet duplex mode to Full-duplex following the auto-negotiation */
        (heth->Init).DuplexMode = ETH_MODE_FULLDUPLEX;
    }
    else
    {
        /* Set Ethernet duplex mode to Half-duplex following the auto-negotiation */
        (heth->Init).DuplexMode = ETH_MODE_HALFDUPLEX;
    }
    /* Configure the MAC with the speed fixed by the auto-negotiation process */
    if((phyreg & PHY_SPEED_STATUS) == PHY_SPEED_STATUS)
    {
        /* Set Ethernet speed to 10M following the auto-negotiation */
        (heth->Init).Speed = ETH_SPEED_10M;
    }
    else
    {
        /* Set Ethernet speed to 100M following the auto-negotiation */
        (heth->Init).Speed = ETH_SPEED_100M;
    }

    /* Config MAC and DMA */
    ETH_MACDMAConfig(heth, err);

    /* Set ETH HAL State to Ready */

    ETH_TransmitFrame_Semaphore = xSemaphoreCreateMutex();

