nickfox-taterli/LwIP_STM32F4-Discovery/Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_ll_eth.c
}

/**
  * @brief  De-Initializes the ETH peripheral.
  * @param  heth pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval HAL status
  */
void LL_ETH_DeInit(void)
{
    /* De-Init the low level hardware : GPIO, CLOCK, NVIC. */
    LL_ETH_MspDeInit();
}

/**
  * @brief  Initializes the DMA Tx descriptors in chain mode.
  * @param  heth pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  DMATxDescTab Pointer to the first Tx desc list
  * @param  TxBuff Pointer to the first TxBuffer list
  * @param  TxBuffCount Number of the used Tx desc in the list
  * @retval HAL status
  */
void LL_ETH_DMATxDescListInit(ETH_HandleTypeDef *heth, ETH_DMADescTypeDef *DMATxDescTab, uint8_t *TxBuff, uint32_t TxBuffCount)
{
    uint32_t i = 0U;
    ETH_DMADescTypeDef *dmatxdesc;
	
    /* Set the DMATxDescToSet pointer with the first one of the DMATxDescTab list */
    heth->TxDesc = DMATxDescTab;

    /* Fill each DMATxDesc descriptor with the right values */
    for(i = 0U; i < TxBuffCount; i++)
    {
        /* Get the pointer on the ith member of the Tx Desc list */
        dmatxdesc = DMATxDescTab + i;

        /* Set Second Address Chained bit */
        dmatxdesc->Status = ETH_DMATXDESC_TCH;

        /* Set Buffer1 address pointer */
        dmatxdesc->Buffer1Addr = (uint32_t)(&TxBuff[i * ETH_TX_BUF_SIZE]);

        /* Set the DMA Tx descriptors checksum insertion */
        dmatxdesc->Status |= ETH_DMATXDESC_CHECKSUMTCPUDPICMPFULL;


        /* Initialize the next descriptor with the Next Descriptor Polling Enable */
        if(i < (TxBuffCount - 1U))
        {
            /* Set next descriptor address register with next descriptor base address */
            dmatxdesc->Buffer2NextDescAddr = (uint32_t)(DMATxDescTab + i + 1U);
        }
        else
        {
            /* For last descriptor, set next descriptor address register equal to the first descriptor base address */
            dmatxdesc->Buffer2NextDescAddr = (uint32_t) DMATxDescTab;
        }
    }

    /* Set Transmit Descriptor List Address Register */
    ETH->DMATDLAR = (uint32_t) DMATxDescTab;

    /* Set ETH HAL State to Ready */
}

/**
  * @brief  Initializes the DMA Rx descriptors in chain mode.
  * @param  heth pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  DMARxDescTab Pointer to the first Rx desc list
  * @param  RxBuff Pointer to the first RxBuffer list
  * @param  RxBuffCount Number of the used Rx desc in the list
  * @retval HAL status
  */
void LL_ETH_DMARxDescListInit(ETH_HandleTypeDef *heth, ETH_DMADescTypeDef *DMARxDescTab, uint8_t *RxBuff, uint32_t RxBuffCount)
{
    uint32_t i = 0U;
    ETH_DMADescTypeDef *DMARxDesc;

    /* Set the Ethernet RxDesc pointer with the first one of the DMARxDescTab list */
    heth->RxDesc = DMARxDescTab;

    /* Fill each DMARxDesc descriptor with the right values */
    for(i = 0U; i < RxBuffCount; i++)
    {
        /* Get the pointer on the ith member of the Rx Desc list */
        DMARxDesc = DMARxDescTab + i;

        /* Set Own bit of the Rx descriptor Status */
        DMARxDesc->Status = ETH_DMARXDESC_OWN;

        /* Set Buffer1 size and Second Address Chained bit */
        DMARxDesc->ControlBufferSize = ETH_DMARXDESC_RCH | ETH_RX_BUF_SIZE;

        /* Set Buffer1 address pointer */
        DMARxDesc->Buffer1Addr = (uint32_t)(&RxBuff[i * ETH_RX_BUF_SIZE]);


        /* Enable Ethernet DMA Rx Descriptor interrupt */
        DMARxDesc->ControlBufferSize &= ~ETH_DMARXDESC_DIC;

        /* Initialize the next descriptor with the Next Descriptor Polling Enable */
        if(i < (RxBuffCount - 1U))
        {
            /* Set next descriptor address register with next descriptor base address */
            DMARxDesc->Buffer2NextDescAddr = (uint32_t)(DMARxDescTab + i + 1U);
        }
        else
        {
            /* For last descriptor, set next descriptor address register equal to the first descriptor base address */
            DMARxDesc->Buffer2NextDescAddr = (uint32_t)(DMARxDescTab);
        }
    }

    /* Set Receive Descriptor List Address Register */
    ETH->DMARDLAR = (uint32_t) DMARxDescTab;
}

/**
  * @}
  */

/** @defgroup ETH_Exported_Functions_Group2 IO operation functions
  *  @brief   Data transfers functions
  *
  @verbatim
  ==============================================================================
                          ##### IO operation functions #####
  ==============================================================================
  [..]  This section provides functions allowing to:
        (+) Transmit a frame
            LL_ETH_TransmitFrame();
        (+) Receive a frame
            LL_ETH_GetReceivedFrame();
            LL_ETH_GetReceivedFrame_IT();
        (+) Read from an External PHY register
            LL_ETH_ReadPHYRegister();
        (+) Write to an External PHY register
            LL_ETH_WritePHYRegister();

  @endverbatim

  * @{
  */

/**
  * @brief  Sends an Ethernet frame.
  * @param  heth pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  FrameLength Amount of data to be sent
  * @retval HAL status
  */
void LL_ETH_TransmitFrame(ETH_HandleTypeDef *heth, uint32_t FrameLength)
{
    uint32_t bufcount = 0U, size = 0U, i = 0U;

    /* Process Locked */
    xSemaphoreTake(ETH_TransmitFrame_Semaphore, portMAX_DELAY);

    if (FrameLength == 0U)
    {
        /* Process Unlocked */
        xSemaphoreGive(ETH_TransmitFrame_Semaphore);

        return;
    }

    /* Check if the descriptor is owned by the ETHERNET DMA (when set) or CPU (when reset) */
    if(((heth->TxDesc)->Status & ETH_DMATXDESC_OWN) != (uint32_t)RESET)
    {
        /* Process Unlocked */
        xSemaphoreGive(ETH_TransmitFrame_Semaphore);

        return;
    }

    /* Get the number of needed Tx buffers for the current frame */
    if (FrameLength > ETH_TX_BUF_SIZE)
    {
        bufcount = FrameLength / ETH_TX_BUF_SIZE;
        if (FrameLength % ETH_TX_BUF_SIZE)
        {
            bufcount++;
        }
    }
    else
    {
        bufcount = 1U;
    }
    if (bufcount == 1U)
    {
        /* Set LAST and FIRST segment */
        heth->TxDesc->Status |= ETH_DMATXDESC_FS | ETH_DMATXDESC_LS;
        /* Set frame size */
        heth->TxDesc->ControlBufferSize = (FrameLength & ETH_DMATXDESC_TBS1);
        /* Set Own bit of the Tx descriptor Status: gives the buffer back to ETHERNET DMA */
        heth->TxDesc->Status |= ETH_DMATXDESC_OWN;
        /* Point to next descriptor */
        heth->TxDesc = (ETH_DMADescTypeDef *)(heth->TxDesc->Buffer2NextDescAddr);
    }
    else
    {
        for (i = 0U; i < bufcount; i++)
        {
            /* Clear FIRST and LAST segment bits */
            heth->TxDesc->Status &= ~(ETH_DMATXDESC_FS | ETH_DMATXDESC_LS);

            if (i == 0U)
            {
                /* Setting the first segment bit */
                heth->TxDesc->Status |= ETH_DMATXDESC_FS;
            }

            /* Program size */
            heth->TxDesc->ControlBufferSize = (ETH_TX_BUF_SIZE & ETH_DMATXDESC_TBS1);

