nickfox-taterli/LwIP_STM32F4-Discovery/Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_ll_eth.c
            if (i == (bufcount - 1U))
            {
                /* Setting the last segment bit */
                heth->TxDesc->Status |= ETH_DMATXDESC_LS;
                size = FrameLength - (bufcount - 1U) * ETH_TX_BUF_SIZE;
                heth->TxDesc->ControlBufferSize = (size & ETH_DMATXDESC_TBS1);
            }

            /* Set Own bit of the Tx descriptor Status: gives the buffer back to ETHERNET DMA */
            heth->TxDesc->Status |= ETH_DMATXDESC_OWN;
            /* point to next descriptor */
            heth->TxDesc = (ETH_DMADescTypeDef *)(heth->TxDesc->Buffer2NextDescAddr);
        }
    }

    /* When Tx Buffer unavailable flag is set: clear it and resume transmission */
    if ((ETH->DMASR & ETH_DMASR_TBUS) != (uint32_t)RESET)
    {
        /* Clear TBUS ETHERNET DMA flag */
        ETH->DMASR = ETH_DMASR_TBUS;
        /* Resume DMA transmission*/
        ETH->DMATPDR = 0U;
    }

    /* Process Unlocked */
    xSemaphoreGive(ETH_TransmitFrame_Semaphore);

}

/**
  * @brief  Checks for received frames.
  * @param  heth pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval HAL status
  */
void LL_ETH_GetReceivedFrame(ETH_HandleTypeDef *heth)
{
    uint32_t framelength = 0U;

    /* Check if segment is not owned by DMA */
    /* (((heth->RxDesc->Status & ETH_DMARXDESC_OWN) == (uint32_t)RESET) && ((heth->RxDesc->Status & ETH_DMARXDESC_LS) != (uint32_t)RESET)) */
    if(((heth->RxDesc->Status & ETH_DMARXDESC_OWN) == (uint32_t)RESET))
    {
        /* Check if last segment */
        if(((heth->RxDesc->Status & ETH_DMARXDESC_LS) != (uint32_t)RESET))
        {
            /* increment segment count */
            (heth->RxFrameInfos).SegCount++;

            /* Check if last segment is first segment: one segment contains the frame */
            if ((heth->RxFrameInfos).SegCount == 1U)
            {
                (heth->RxFrameInfos).FSRxDesc = heth->RxDesc;
            }

            heth->RxFrameInfos.LSRxDesc = heth->RxDesc;

            /* Get the Frame Length of the received packet: substruct 4 bytes of the CRC */
            framelength = (((heth->RxDesc)->Status & ETH_DMARXDESC_FL) >> ETH_DMARXDESC_FRAMELENGTHSHIFT) - 4U;
            heth->RxFrameInfos.length = framelength;

            /* Get the address of the buffer start address */
            heth->RxFrameInfos.buffer = ((heth->RxFrameInfos).FSRxDesc)->Buffer1Addr;
            /* point to next descriptor */
            heth->RxDesc = (ETH_DMADescTypeDef *) ((heth->RxDesc)->Buffer2NextDescAddr);
        }
        /* Check if first segment */
        else if((heth->RxDesc->Status & ETH_DMARXDESC_FS) != (uint32_t)RESET)
        {
            (heth->RxFrameInfos).FSRxDesc = heth->RxDesc;
            (heth->RxFrameInfos).LSRxDesc = NULL;
            (heth->RxFrameInfos).SegCount = 1U;
            /* Point to next descriptor */
            heth->RxDesc = (ETH_DMADescTypeDef *) (heth->RxDesc->Buffer2NextDescAddr);
        }
        /* Check if intermediate segment */
        else
        {
            (heth->RxFrameInfos).SegCount++;
            /* Point to next descriptor */
            heth->RxDesc = (ETH_DMADescTypeDef *) (heth->RxDesc->Buffer2NextDescAddr);
        }
    }

}

/**
  * @brief  Gets the Received frame in interrupt mode.
  * @param  heth pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval HAL status
  */
uint8_t LL_ETH_GetReceivedFrame_IT(ETH_HandleTypeDef *heth)
{
    uint32_t descriptorscancounter = 0U;

    /* Scan descriptors owned by CPU */
    while (((heth->RxDesc->Status & ETH_DMARXDESC_OWN) == (uint32_t)RESET) && (descriptorscancounter < ETH_RXBUFNB))
    {
        /* Just for security */
        descriptorscancounter++;

        /* Check if first segment in frame */
        /* ((heth->RxDesc->Status & ETH_DMARXDESC_FS) != (uint32_t)RESET) && ((heth->RxDesc->Status & ETH_DMARXDESC_LS) == (uint32_t)RESET)) */
        if((heth->RxDesc->Status & (ETH_DMARXDESC_FS | ETH_DMARXDESC_LS)) == (uint32_t)ETH_DMARXDESC_FS)
        {
            heth->RxFrameInfos.FSRxDesc = heth->RxDesc;
            heth->RxFrameInfos.SegCount = 1U;
            /* Point to next descriptor */
            heth->RxDesc = (ETH_DMADescTypeDef *) (heth->RxDesc->Buffer2NextDescAddr);
        }
        /* Check if intermediate segment */
        /* ((heth->RxDesc->Status & ETH_DMARXDESC_LS) == (uint32_t)RESET)&& ((heth->RxDesc->Status & ETH_DMARXDESC_FS) == (uint32_t)RESET)) */
        else if ((heth->RxDesc->Status & (ETH_DMARXDESC_LS | ETH_DMARXDESC_FS)) == (uint32_t)RESET)
        {
            /* Increment segment count */
            (heth->RxFrameInfos.SegCount)++;
            /* Point to next descriptor */
            heth->RxDesc = (ETH_DMADescTypeDef *)(heth->RxDesc->Buffer2NextDescAddr);
        }
        /* Should be last segment */
        else
        {
            /* Last segment */
            heth->RxFrameInfos.LSRxDesc = heth->RxDesc;

            /* Increment segment count */
            (heth->RxFrameInfos.SegCount)++;

            /* Check if last segment is first segment: one segment contains the frame */
            if ((heth->RxFrameInfos.SegCount) == 1U)
            {
                heth->RxFrameInfos.FSRxDesc = heth->RxDesc;
            }

            /* Get the Frame Length of the received packet: substruct 4 bytes of the CRC */
            heth->RxFrameInfos.length = (((heth->RxDesc)->Status & ETH_DMARXDESC_FL) >> ETH_DMARXDESC_FRAMELENGTHSHIFT) - 4U;

            /* Get the address of the buffer start address */
            heth->RxFrameInfos.buffer = ((heth->RxFrameInfos).FSRxDesc)->Buffer1Addr;

            /* Point to next descriptor */
            heth->RxDesc = (ETH_DMADescTypeDef *) (heth->RxDesc->Buffer2NextDescAddr);
            return 0;
        }
    }
    return 1;
}

/**
  * @brief  This function handles ETH interrupt request.
  * @param  heth pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval HAL status
  */
void LL_ETH_IRQHandler(void)
{
    /* Frame received */
    if((ETH->DMASR & ( ETH_DMA_FLAG_R)) == ( ETH_DMA_FLAG_R))
    {
        /* Receive complete callback */
        LL_ETH_RxCpltCallback();

        /* Clear the Eth DMA Rx IT pending bits */
        ETH->DMASR = ETH_DMA_IT_R;

