nickfox-taterli/LwIP_STM32F4-Discovery/Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_ll_eth.c
    }
    /* Frame transmitted */
    else if((ETH->DMASR & ( ETH_DMA_FLAG_T)) == ( ETH_DMA_FLAG_T))
    {
        /* Transfer complete callback */
        /* 发送完成中断 */

        /* Clear the Eth DMA Tx IT pending bits */
        ETH->DMASR = ETH_DMA_IT_T;

    }

    /* Clear the interrupt flags */
    ETH->DMASR = ETH_DMA_IT_NIS;

    /* ETH DMA Error */
    if((ETH->DMASR & ( ETH_DMA_FLAG_AIS)) == ( ETH_DMA_FLAG_AIS))
    {
        /* Ethernet Error callback */
        /* 此处需要错误处理 */

        /* Clear the interrupt flags */
        ETH->DMASR = ETH_DMA_FLAG_AIS;

    }
}

/**
  * @brief  Reads a PHY register
  * @param  heth pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param PHYReg PHY register address, is the index of one of the 32 PHY register.
  *                This parameter can be one of the following values:
  *                   PHY_BCR: Transceiver Basic Control Register,
  *                   PHY_BSR: Transceiver Basic Status Register.
  *                   More PHY register could be read depending on the used PHY
  * @param RegValue PHY register value
  * @retval HAL status
  */
void LL_ETH_ReadPHYRegister(ETH_HandleTypeDef *heth, uint16_t PHYReg, uint32_t *RegValue)
{
    uint32_t tmpreg1 = 0U;

    /* Get the ETHERNET MACMIIAR value */
    tmpreg1 = ETH->MACMIIAR;

    /* Keep only the CSR Clock Range CR[2:0] bits value */
    tmpreg1 &= ~ETH_MACMIIAR_CR_MASK;

    /* Prepare the MII address register value */
    tmpreg1 |= (((uint32_t)heth->Init.PhyAddress << 11U) & ETH_MACMIIAR_PA); /* Set the PHY device address   */
    tmpreg1 |= (((uint32_t)PHYReg << 6U) & ETH_MACMIIAR_MR);                /* Set the PHY register address */
    tmpreg1 &= ~ETH_MACMIIAR_MW;                                            /* Set the read mode            */
    tmpreg1 |= ETH_MACMIIAR_MB;                                             /* Set the MII Busy bit         */

    /* Write the result value into the MII Address register */
    ETH->MACMIIAR = tmpreg1;
    /* Check for the Busy flag */
    while((tmpreg1 & ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB)
    {
        tmpreg1 = ETH->MACMIIAR;
    }
    /* Get MACMIIDR value */
    *RegValue = (uint16_t)(ETH->MACMIIDR);

}

/**
  * @brief  Writes to a PHY register.
  * @param  heth pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  PHYReg PHY register address, is the index of one of the 32 PHY register.
  *          This parameter can be one of the following values:
  *             PHY_BCR: Transceiver Control Register.
  *             More PHY register could be written depending on the used PHY
  * @param  RegValue the value to write
  * @retval HAL status
  */
void LL_ETH_WritePHYRegister(ETH_HandleTypeDef *heth, uint16_t PHYReg, uint32_t RegValue)
{
    uint32_t tmpreg1 = 0U;

    /* Get the ETHERNET MACMIIAR value */
    tmpreg1 = ETH->MACMIIAR;

    /* Keep only the CSR Clock Range CR[2:0] bits value */
    tmpreg1 &= ~ETH_MACMIIAR_CR_MASK;

    /* Prepare the MII register address value */
    tmpreg1 |= (((uint32_t)heth->Init.PhyAddress << 11U) & ETH_MACMIIAR_PA); /* Set the PHY device address */
    tmpreg1 |= (((uint32_t)PHYReg << 6U) & ETH_MACMIIAR_MR);              /* Set the PHY register address */
    tmpreg1 |= ETH_MACMIIAR_MW;                                           /* Set the write mode */
    tmpreg1 |= ETH_MACMIIAR_MB;                                           /* Set the MII Busy bit */

    /* Give the value to the MII data register */
    ETH->MACMIIDR = (uint16_t)RegValue;

    /* Write the result value into the MII Address register */
    ETH->MACMIIAR = tmpreg1;

    /* Check for the Busy flag */
    while((tmpreg1 & ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB)
    {
        tmpreg1 = ETH->MACMIIAR;
    }

}

/**
  * @}
  */

/** @defgroup ETH_Exported_Functions_Group3 Peripheral Control functions
 *  @brief    Peripheral Control functions
 *
@verbatim
 ===============================================================================
                  ##### Peripheral Control functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Enable MAC and DMA transmission and reception.
          LL_ETH_Start();
      (+) Disable MAC and DMA transmission and reception.
          LL_ETH_Stop();
      (+) Set the MAC configuration in runtime mode
          LL_ETH_ConfigMAC();
      (+) Set the DMA configuration in runtime mode
          LL_ETH_ConfigDMA();

@endverbatim
  * @{
  */

/**
 * @brief  Enables Ethernet MAC and DMA reception/transmission
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval HAL status
 */
void LL_ETH_Start(void)
{

    /* Enable transmit state machine of the MAC for transmission on the MII */
    ETH_MACTransmissionEnable();

    /* Enable receive state machine of the MAC for reception from the MII */
    ETH_MACReceptionEnable();

    /* Flush Transmit FIFO */
    ETH_FlushTransmitFIFO();

    /* Start DMA transmission */
    ETH_DMATransmissionEnable();

    /* Start DMA reception */
    ETH_DMAReceptionEnable();

}

/**
  * @brief  Stop Ethernet MAC and DMA reception/transmission
  * @param  heth pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval HAL status
  */
void LL_ETH_Stop(void)
{

    /* Stop DMA transmission */
    ETH_DMATransmissionDisable();

    /* Stop DMA reception */
    ETH_DMAReceptionDisable();

    /* Disable receive state machine of the MAC for reception from the MII */
    ETH_MACReceptionDisable();

    /* Flush Transmit FIFO */
    ETH_FlushTransmitFIFO();

    /* Disable transmit state machine of the MAC for transmission on the MII */
    ETH_MACTransmissionDisable();

}

/**
  * @brief  Set ETH MAC Configuration.
  * @param  heth pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  macconf MAC Configuration structure
  * @retval HAL status
  */
void LL_ETH_ConfigMAC(ETH_HandleTypeDef *heth, ETH_MACInitTypeDef *macconf)
{
    uint32_t tmpreg1 = 0U;

    if (macconf != NULL)
    {

