nickfox-taterli/LwIP_STM32F4-Discovery/Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_ll_eth.c
        /*------------------------ ETHERNET MACCR Configuration --------------------*/
        /* Get the ETHERNET MACCR value */
        tmpreg1 = ETH->MACCR;
        /* Clear WD, PCE, PS, TE and RE bits */
        tmpreg1 &= ETH_MACCR_CLEAR_MASK;

        tmpreg1 |= (uint32_t)(macconf->Watchdog |
                              macconf->Jabber |
                              macconf->InterFrameGap |
                              macconf->CarrierSense |
                              (heth->Init).Speed |
                              macconf->ReceiveOwn |
                              macconf->LoopbackMode |
                              (heth->Init).DuplexMode |
                              macconf->ChecksumOffload |
                              macconf->RetryTransmission |
                              macconf->AutomaticPadCRCStrip |
                              macconf->BackOffLimit |
                              macconf->DeferralCheck);

        /* Write to ETHERNET MACCR */
        ETH->MACCR = (uint32_t)tmpreg1;

        /* Wait until the write operation will be taken into account :
        at least four TX_CLK/RX_CLK clock cycles */
        tmpreg1 = ETH->MACCR;
        vTaskDelay(ETH_REG_WRITE_DELAY);
        ETH->MACCR = tmpreg1;

        /*----------------------- ETHERNET MACFFR Configuration --------------------*/
        /* Write to ETHERNET MACFFR */
        ETH->MACFFR = (uint32_t)(macconf->ReceiveAll |
                                 macconf->SourceAddrFilter |
                                 macconf->PassControlFrames |
                                 macconf->BroadcastFramesReception |
                                 macconf->DestinationAddrFilter |
                                 macconf->PromiscuousMode |
                                 macconf->MulticastFramesFilter |
                                 macconf->UnicastFramesFilter);

        /* Wait until the write operation will be taken into account :
        at least four TX_CLK/RX_CLK clock cycles */
        tmpreg1 = ETH->MACFFR;
        vTaskDelay(ETH_REG_WRITE_DELAY);
        ETH->MACFFR = tmpreg1;

        /*--------------- ETHERNET MACHTHR and MACHTLR Configuration ---------------*/
        /* Write to ETHERNET MACHTHR */
        ETH->MACHTHR = (uint32_t)macconf->HashTableHigh;

        /* Write to ETHERNET MACHTLR */
        ETH->MACHTLR = (uint32_t)macconf->HashTableLow;
        /*----------------------- ETHERNET MACFCR Configuration --------------------*/

        /* Get the ETHERNET MACFCR value */
        tmpreg1 = ETH->MACFCR;
        /* Clear xx bits */
        tmpreg1 &= ETH_MACFCR_CLEAR_MASK;

        tmpreg1 |= (uint32_t)((macconf->PauseTime << 16U) |
                              macconf->ZeroQuantaPause |
                              macconf->PauseLowThreshold |
                              macconf->UnicastPauseFrameDetect |
                              macconf->ReceiveFlowControl |
                              macconf->TransmitFlowControl);

        /* Write to ETHERNET MACFCR */
        ETH->MACFCR = (uint32_t)tmpreg1;

        /* Wait until the write operation will be taken into account :
        at least four TX_CLK/RX_CLK clock cycles */
        tmpreg1 = ETH->MACFCR;
        vTaskDelay(ETH_REG_WRITE_DELAY);
        ETH->MACFCR = tmpreg1;

        /*----------------------- ETHERNET MACVLANTR Configuration -----------------*/
        ETH->MACVLANTR = (uint32_t)(macconf->VLANTagComparison |
                                    macconf->VLANTagIdentifier);

        /* Wait until the write operation will be taken into account :
        at least four TX_CLK/RX_CLK clock cycles */
        tmpreg1 = ETH->MACVLANTR;
        vTaskDelay(ETH_REG_WRITE_DELAY);
        ETH->MACVLANTR = tmpreg1;
    }
    else /* macconf == NULL : here we just configure Speed and Duplex mode */
    {
        /*------------------------ ETHERNET MACCR Configuration --------------------*/
        /* Get the ETHERNET MACCR value */
        tmpreg1 = ETH->MACCR;

        /* Clear FES and DM bits */
        tmpreg1 &= ~(0x00004800U);

        tmpreg1 |= (uint32_t)(heth->Init.Speed | heth->Init.DuplexMode);

        /* Write to ETHERNET MACCR */
        ETH->MACCR = (uint32_t)tmpreg1;

        /* Wait until the write operation will be taken into account:
        at least four TX_CLK/RX_CLK clock cycles */
        tmpreg1 = ETH->MACCR;
        vTaskDelay(ETH_REG_WRITE_DELAY);
        ETH->MACCR = tmpreg1;
    }

}

/**
  * @brief  Sets ETH DMA Configuration.
  * @param  heth pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  dmaconf DMA Configuration structure
  * @retval HAL status
  */
void LL_ETH_ConfigDMA(ETH_HandleTypeDef *heth, ETH_DMAInitTypeDef *dmaconf)
{
    uint32_t tmpreg1 = 0U;

    /*----------------------- ETHERNET DMAOMR Configuration --------------------*/
    /* Get the ETHERNET DMAOMR value */
    tmpreg1 = ETH->DMAOMR;
    /* Clear xx bits */
    tmpreg1 &= ETH_DMAOMR_CLEAR_MASK;

    tmpreg1 |= (uint32_t)(dmaconf->DropTCPIPChecksumErrorFrame |
                          dmaconf->ReceiveStoreForward |
                          dmaconf->FlushReceivedFrame |
                          dmaconf->TransmitStoreForward |
                          dmaconf->TransmitThresholdControl |
                          dmaconf->ForwardErrorFrames |
                          dmaconf->ForwardUndersizedGoodFrames |
                          dmaconf->ReceiveThresholdControl |
                          dmaconf->SecondFrameOperate);

    /* Write to ETHERNET DMAOMR */
    ETH->DMAOMR = (uint32_t)tmpreg1;

    /* Wait until the write operation will be taken into account:
    at least four TX_CLK/RX_CLK clock cycles */
    tmpreg1 = ETH->DMAOMR;
    vTaskDelay(ETH_REG_WRITE_DELAY);
    ETH->DMAOMR = tmpreg1;

    /*----------------------- ETHERNET DMABMR Configuration --------------------*/
    ETH->DMABMR = (uint32_t)(dmaconf->AddressAlignedBeats |
                             dmaconf->FixedBurst |
                             dmaconf->RxDMABurstLength | /* !! if 4xPBL is selected for Tx or Rx it is applied for the other */
                             dmaconf->TxDMABurstLength |
                             dmaconf->EnhancedDescriptorFormat |
                             (dmaconf->DescriptorSkipLength << 2U) |
                             dmaconf->DMAArbitration |
                             ETH_DMABMR_USP); /* Enable use of separate PBL for Rx and Tx */

