nickfox-taterli/LwIP_STM32F4-Discovery/Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_ll_eth.c
    /* Wait until the write operation will be taken into account:
       at least four TX_CLK/RX_CLK clock cycles */
    tmpreg1 = ETH->DMABMR;
    vTaskDelay(ETH_REG_WRITE_DELAY);
    ETH->DMABMR = tmpreg1;

}

/**
  * @}
  */

/** @defgroup ETH_Exported_Functions_Group4 Peripheral State functions
  *  @brief   Peripheral State functions
  *
  @verbatim
  ===============================================================================
                         ##### Peripheral State functions #####
  ===============================================================================
  [..]
  This subsection permits to get in run-time the status of the peripheral
  and the data flow.
       (+) Get the ETH handle state:
           LL_ETH_GetState();


  @endverbatim
  * @{
  */


/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup ETH_Private_Functions
  * @{
  */

/**
  * @brief  Configures Ethernet MAC and DMA with default parameters.
  * @param  heth pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  err Ethernet Init error
  * @retval HAL status
  */
static void ETH_MACDMAConfig(ETH_HandleTypeDef *heth, uint32_t err)
{
    ETH_MACInitTypeDef macinit;
    ETH_DMAInitTypeDef dmainit;
    uint32_t tmpreg1 = 0U;

    if (err != ETH_SUCCESS) /* Auto-negotiation failed */
    {
        /* Set Ethernet duplex mode to Full-duplex */
        (heth->Init).DuplexMode = ETH_MODE_FULLDUPLEX;

        /* Set Ethernet speed to 100M */
        (heth->Init).Speed = ETH_SPEED_100M;
    }

    /* Ethernet MAC default initialization **************************************/
    macinit.Watchdog = ETH_WATCHDOG_ENABLE;
    macinit.Jabber = ETH_JABBER_ENABLE;
    macinit.InterFrameGap = ETH_INTERFRAMEGAP_96BIT;
    macinit.CarrierSense = ETH_CARRIERSENCE_ENABLE;
    macinit.ReceiveOwn = ETH_RECEIVEOWN_ENABLE;
    macinit.LoopbackMode = ETH_LOOPBACKMODE_DISABLE;
    macinit.ChecksumOffload = ETH_CHECKSUMOFFLAOD_ENABLE;
    macinit.RetryTransmission = ETH_RETRYTRANSMISSION_DISABLE;
    macinit.AutomaticPadCRCStrip = ETH_AUTOMATICPADCRCSTRIP_DISABLE;
    macinit.BackOffLimit = ETH_BACKOFFLIMIT_10;
    macinit.DeferralCheck = ETH_DEFFERRALCHECK_DISABLE;
    macinit.ReceiveAll = ETH_RECEIVEAll_DISABLE;
    macinit.SourceAddrFilter = ETH_SOURCEADDRFILTER_DISABLE;
    macinit.PassControlFrames = ETH_PASSCONTROLFRAMES_BLOCKALL;
    macinit.BroadcastFramesReception = ETH_BROADCASTFRAMESRECEPTION_ENABLE;
    macinit.DestinationAddrFilter = ETH_DESTINATIONADDRFILTER_NORMAL;
    macinit.PromiscuousMode = ETH_PROMISCUOUS_MODE_DISABLE;
    macinit.MulticastFramesFilter = ETH_MULTICASTFRAMESFILTER_PERFECT;
    macinit.UnicastFramesFilter = ETH_UNICASTFRAMESFILTER_PERFECT;
    macinit.HashTableHigh = 0x0U;
    macinit.HashTableLow = 0x0U;
    macinit.PauseTime = 0x0U;
    macinit.ZeroQuantaPause = ETH_ZEROQUANTAPAUSE_DISABLE;
    macinit.PauseLowThreshold = ETH_PAUSELOWTHRESHOLD_MINUS4;
    macinit.UnicastPauseFrameDetect = ETH_UNICASTPAUSEFRAMEDETECT_DISABLE;
    macinit.ReceiveFlowControl = ETH_RECEIVEFLOWCONTROL_DISABLE;
    macinit.TransmitFlowControl = ETH_TRANSMITFLOWCONTROL_DISABLE;
    macinit.VLANTagComparison = ETH_VLANTAGCOMPARISON_16BIT;
    macinit.VLANTagIdentifier = 0x0U;

    /*------------------------ ETHERNET MACCR Configuration --------------------*/
    /* Get the ETHERNET MACCR value */
    tmpreg1 = ETH->MACCR;
    /* Clear WD, PCE, PS, TE and RE bits */
    tmpreg1 &= ETH_MACCR_CLEAR_MASK;
    /* Set the WD bit according to ETH Watchdog value */
    /* Set the JD: bit according to ETH Jabber value */
    /* Set the IFG bit according to ETH InterFrameGap value */
    /* Set the DCRS bit according to ETH CarrierSense value */
    /* Set the FES bit according to ETH Speed value */
    /* Set the DO bit according to ETH ReceiveOwn value */
    /* Set the LM bit according to ETH LoopbackMode value */
    /* Set the DM bit according to ETH Mode value */
    /* Set the IPCO bit according to ETH ChecksumOffload value */
    /* Set the DR bit according to ETH RetryTransmission value */
    /* Set the ACS bit according to ETH AutomaticPadCRCStrip value */
    /* Set the BL bit according to ETH BackOffLimit value */
    /* Set the DC bit according to ETH DeferralCheck value */
    tmpreg1 |= (uint32_t)(macinit.Watchdog |
                          macinit.Jabber |
                          macinit.InterFrameGap |
                          macinit.CarrierSense |
                          (heth->Init).Speed |
                          macinit.ReceiveOwn |
                          macinit.LoopbackMode |
                          (heth->Init).DuplexMode |
                          macinit.ChecksumOffload |
                          macinit.RetryTransmission |
                          macinit.AutomaticPadCRCStrip |
                          macinit.BackOffLimit |
                          macinit.DeferralCheck);

    /* Write to ETHERNET MACCR */
    ETH->MACCR = (uint32_t)tmpreg1;

    /* Wait until the write operation will be taken into account:
       at least four TX_CLK/RX_CLK clock cycles */
    tmpreg1 = ETH->MACCR;
    vTaskDelay(ETH_REG_WRITE_DELAY);
    ETH->MACCR = tmpreg1;

    /*----------------------- ETHERNET MACFFR Configuration --------------------*/
    /* Set the RA bit according to ETH ReceiveAll value */
    /* Set the SAF and SAIF bits according to ETH SourceAddrFilter value */
    /* Set the PCF bit according to ETH PassControlFrames value */
    /* Set the DBF bit according to ETH BroadcastFramesReception value */
    /* Set the DAIF bit according to ETH DestinationAddrFilter value */
    /* Set the PR bit according to ETH PromiscuousMode value */
    /* Set the PM, HMC and HPF bits according to ETH MulticastFramesFilter value */
    /* Set the HUC and HPF bits according to ETH UnicastFramesFilter value */
    /* Write to ETHERNET MACFFR */
    ETH->MACFFR = (uint32_t)(macinit.ReceiveAll |
                             macinit.SourceAddrFilter |
                             macinit.PassControlFrames |
                             macinit.BroadcastFramesReception |
                             macinit.DestinationAddrFilter |
                             macinit.PromiscuousMode |
                             macinit.MulticastFramesFilter |
                             macinit.UnicastFramesFilter);

